-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 26, 2019 at 04:05 PM
-- Server version: 10.4.8-MariaDB
-- PHP Version: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `hrdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `employee`
--

CREATE TABLE `employee` (
  `emp_id` int(11) NOT NULL,
  `emp_empid` int(11) NOT NULL COMMENT 'รหัสพนังงาน',
  `emp_fname` varchar(255) NOT NULL COMMENT 'ชื่อ',
  `emp_lname` varchar(255) NOT NULL COMMENT 'สกุล',
  `emp_address` varchar(255) NOT NULL COMMENT 'ที่อยู่(จังหวัด)',
  `emp_phone` varchar(15) NOT NULL COMMENT 'เบอร์โทรศัพท์'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee`
--

INSERT INTO `employee` (`emp_id`, `emp_empid`, `emp_fname`, `emp_lname`, `emp_address`, `emp_phone`) VALUES
(2, 1300, 'นายเดชาธร', 'นารถสูง', 'ขอนแก่น', '091-0656644'),
(3, 1318, 'นายธราธร', 'ทองหอม', 'บุรีรัมย์', '090-4138202'),
(4, 1326, 'นายธราธร', 'ทองโคตร', 'ขอนแก่น', '093-3264186'),
(5, 1334, 'นายธีรพัฒน์', 'ผ่องแผ้ว', 'นครราชสีมา', '065-0305374'),
(6, 1350, 'น.ส.นุสราทิพทย์', 'มีกุศล', 'อุบลราชธานี', '094-3941670'),
(7, 1368, 'น.ส.เบญจวรรณ', 'ทับดู่', 'มหาสารคาม', '098-5203043'),
(8, 1384, 'น.ส.พรรณธิดา', 'สมภพ', 'ขอนแก่น', '095-2813369'),
(9, 1392, 'น.ส.พรรณาราย', 'ดีจันทร์', 'มหาสารคาม', '093-3240958'),
(10, 1407, 'น.ส.พัชริญา', 'พัฒนโพธิ์', 'กาฬสินธุ์', '099-0429197'),
(11, 1415, 'น.ส.พิชญ์สินี', 'คันทะจันทร์', 'ขอนแก่น', '099-3285064'),
(12, 1431, 'นายมนฤทธิ์', 'เดชประเสริฐ', 'หนองบัวลำภู', '080-6137208'),
(13, 1538, 'น.ส.เสาวนิตย์', 'พึ่งสว่าง', 'ขอนแก่น', '082-7362026'),
(14, 1546, 'น.ส.อาริยา', 'ก้อนแพง', 'สกลนคร', '062-8077714'),
(15, 1554, 'น.ส.อิศราภรณ์', 'จารุกมูล', 'อุบลราชธานี', '086-8794717'),
(16, 1863, 'น.ส.พิพรรชน์', 'มิตรชื่น', 'ชัยภูมิ', '095-1784926'),
(17, 1910, 'น.ส.สรัลชนา', 'เจริญจิตต์', 'ขอนแก่น', '087-4348832'),
(18, 1936, 'น.ส.สิดาพร', 'เครือวรรณ', 'กาฬสินธุ์', '084-5313294'),
(19, 2259, 'น.ส.กนกวรรณ', 'ป้องปาน', 'ขอนแก่น', '094-2928131'),
(20, 2267, 'น.ส.กรกมล', 'ตรงมหาวิเศษ', 'อุดรธานี', '093-5845694'),
(21, 2283, 'น.ส.ชินานาฎ', 'ประเสริฐสังข์', 'ขอนแก่น', '086-8418448'),
(22, 2314, 'น.ส.ปิยภรณ์', 'นำเนตร์', 'ขอนแก่น', '096-5631783'),
(23, 2330, 'น.ส.วิภาวี', 'ยิ่งกำแหง', 'พิจิตร', '082-8780858'),
(24, 2356, 'น.ส.สโรชา', 'สีทะเล', 'นคราชสีมา', '093-5510672'),
(25, 2429, 'น.ส.วิลาวรรณ', 'คงแก้ว', 'ตรัง', '082-9212071'),
(26, 2649, 'น.ส.ชุติมา', 'อวนศรี', 'ร้อยเอ็ด', '095-9588339'),
(27, 3239, 'นายกิติพงษ์', 'แสงห้วยไผ่', 'ขอนแก่น', '094-6174547'),
(28, 3263, 'น.ส.เรณู', 'ไทยวังชัย', 'ขอนแก่น', '080-3237340'),
(29, 3271, 'น.ส.สุจิตรา', 'ประเสริฐศิลป์', 'ขอนแก่น', '096-6631403'),
(30, 3297, 'น.ส.อมิตา', 'เรืองชิต', 'กาฬสินธุ์', '090-8509464'),
(31, 4561, 'น.ส. นิศากร', 'ทองบรรจบ', 'ร้อยเอ็ด', '092-5436789'),
(32, 4562, 'นายสุชาติ ', 'คงหนู', 'เชียงราย', '098-2345678'),
(33, 4563, 'นายสุรัตน์', 'รามแป้น', 'ชัยภูมิ', '090-1456789'),
(34, 4564, 'นายสุนทร', 'พูลแก้ว', 'มหาสารคาม', '097-2451652'),
(35, 4565, 'นายสกูล', 'แก้วพิจิตร', 'ขอนแก่น', '097-1235421'),
(36, 4566, 'น.ส.รัตติยา', 'นาควิทูร', 'พิจิตร', '097-3251678'),
(37, 4567, 'น.ส.ยุวดี', 'พลายด้วง', 'เลย', '098-2587524'),
(38, 4568, 'นางกิตติมา', 'ราเหม', 'พิษณุโลก', '096-3245678'),
(39, 4569, 'นายทศพล', 'มิ่งแก้ว', 'หนองบัวลำภู', '097-3412654'),
(40, 4570, 'นายธีรวัต', 'หนูรักษ์', 'สุรินทร์', '092-1287654'),
(41, 4571, 'นายกมล', 'บัวอิน', 'นครสวรรค์', '092-1287695'),
(42, 4572, 'นายประเสริฐ', 'คงประมูล', 'ตรัง', '093-1278653'),
(43, 4573, 'นายอาคม', 'กาเลี่ยง ', 'จันทบุรี', '098-5412376'),
(44, 4574, 'นายยุรนันท์', 'ทองจินดา', 'เลย', '091-2375893'),
(45, 4575, 'นางธิราวัล', 'ทองแก้ว ', 'สุรินทร์', '092-4869045'),
(46, 4576, 'น.ส.โสภานน', 'ทองสิพพัญญู', 'บุรีรัมย์', '096-2376584'),
(47, 4577, 'นายเจษฎา', 'ทิมลาย', 'กำแพงเพชร', '098-2314562'),
(48, 4578, 'นายแดง', 'อนุพันธ์', 'หนองบัวลำภู', '092-6748967'),
(49, 4579, 'นายดิเรก', 'อนุเปโถ ', 'ยโสธร', '096-2467758'),
(50, 4580, 'นายสนิท', 'หนูแก้ว', 'หนองคาย', '099-4797563'),
(76, 12, 'Jiramate', 'Phuaphan', '2/26\r\n-', '0847810462');

-- --------------------------------------------------------

--
-- Table structure for table `employee_department`
--

CREATE TABLE `employee_department` (
  `empdp_id` int(11) NOT NULL,
  `empdp_empid` int(11) NOT NULL COMMENT 'รหัสพนักงาน',
  `empdp_department` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT 'แผนก',
  `empdp_position` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT 'ตำแหน่ง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_department`
--

INSERT INTO `employee_department` (`empdp_id`, `empdp_empid`, `empdp_department`, `empdp_position`) VALUES
(4581, 1300, 'บุคคล', 'เงินเดือน/สวัสดิการ'),
(4582, 1318, 'การตลาด', 'นักวิเคราะห์'),
(4583, 1326, 'จัดซื้อ', 'หัวหน้าแผนก'),
(4584, 1334, 'ผลิต', 'หัวหน้าแผนก'),
(4585, 1350, 'บัญชี', 'เจ้าหน้าที่บัญชีทั่วไป'),
(4586, 1368, 'สินค้าคงคลัง', 'ประสานงาน'),
(4587, 1384, 'จัดซื้อ', 'เจ้าหน้าที่จัดซื้อ'),
(4588, 1392, 'ผลิต', 'เช็ควัตถุดิบ'),
(4589, 1407, 'สินค้าคงคลัง', 'พนักงานเช็คสต๊อก'),
(4590, 1415, 'สินค้าคงคลัง', 'เจ้าหน้าที่คลังสินค้า'),
(4591, 1431, 'สินค้าคงคลัง', 'หัวหน้าแผนกคลังสินค้า'),
(4592, 1538, 'จัดซื้อ', 'เจ้าหน้าที่ตรวจสอบ'),
(4593, 1546, 'บัญชี', 'เจ้าหน้าที่ตรวจสอบภายใน'),
(4594, 1554, 'ผลิต', 'ตรวจสอบสินค้า'),
(4595, 1863, 'บัญชี', 'เจ้าหน้าที่แผนกคอมฯ'),
(4596, 1910, 'ผลิต', 'ควบคุมการผลิต'),
(4597, 1936, 'ผลิต', 'วางแผนการผลิต'),
(4598, 2259, 'การตลาด', 'วิจัยพัฒนาสินค้า'),
(4599, 2267, 'บุคคล', 'เจ้าหน้าที่ฝึกอบรบพนักงาน'),
(4600, 2283, 'บุคคล', 'เจ้าหน้าที่คัดสรรพักงาน'),
(4601, 2314, 'จัดซื้อ', 'พนักงานดูแลเอกสาร'),
(4602, 2330, 'จัดซื้อ', 'เจ้าหน้าที่ประสานงาน'),
(4603, 2356, 'บัญชี', 'งบประมาณและสถิติ'),
(4604, 2429, 'สินค้าคงคลัง', 'บัญชีคลังสินค้า'),
(4605, 2649, 'การตลาด', 'ออกแบบโฆษณา'),
(4606, 3239, 'บุคคล', 'ประเมินวางแผนกำลังคน'),
(4607, 3263, 'การตลาด', 'ผู้จัดการตลาด'),
(4608, 3271, 'การตลาด', 'ผู้จัดการฝ่ายขาย'),
(4609, 3297, 'บุคคล', 'จัดการบุคลากร'),
(4610, 4561, 'การตลาด', 'รองผู้จัดการ'),
(4611, 4562, 'การตลาด', 'พนักงานขาย'),
(4612, 4563, 'การตลาด', 'เลขา'),
(4613, 4564, 'การตลาด', 'พนักงานขาย'),
(4614, 4565, 'การตลาด', 'พนักงานขาย'),
(4615, 4566, 'การตลาด', 'ประชาสัมพันธ์'),
(4616, 4567, 'การตลาด', 'พนักงานขาย'),
(4617, 4568, 'การตลาด', 'พนักงานขาย'),
(4618, 4569, 'การตลาด', 'พนักงานขาย'),
(4619, 4570, 'การตลาด', 'พนักงานขาย'),
(4620, 4571, 'การตลาด', 'พนักงานขาย'),
(4621, 4572, 'การตลาด', 'ผู้ช่วยผู้จัดการ'),
(4622, 4573, 'ผลิต', 'พนักงานบรรจุ'),
(4623, 4574, 'ผลิต', 'พนักงานบรรจุ'),
(4624, 4575, 'ผลิต', 'พนักงานเช็คสต็อก'),
(4625, 4576, 'ผลิต', 'พนักงานขนสินค้า'),
(4626, 4577, 'ผลิต', 'พนักงานคุมเครื่องจักร'),
(4627, 4578, 'ผลิต', 'พนักงานคุมเครื่องจักร'),
(4628, 4579, 'ผลิต', 'พนักงานบรรจุ'),
(4629, 4580, 'ผลิต', 'พนักงานขนสินค้า'),
(4633, 12, '-', '-');

-- --------------------------------------------------------

--
-- Table structure for table `employee_log_time`
--

CREATE TABLE `employee_log_time` (
  `empw_id` int(11) NOT NULL,
  `empw_empid` int(11) NOT NULL COMMENT 'รหัสพนักงาน',
  `empw_name` varchar(255) NOT NULL COMMENT 'ชื่อผู้กรอก',
  `empw_time_in` time NOT NULL DEFAULT current_timestamp() COMMENT 'เวลาเข้างาน',
  `empw_time_out` time NOT NULL DEFAULT current_timestamp() COMMENT 'เวลาออกงาน',
  `empw_sum_hr` time NOT NULL COMMENT 'ชั่วโมงงานทั้งหมด',
  `empw_ot` time NOT NULL COMMENT 'OT',
  `empw_date` date NOT NULL DEFAULT current_timestamp() COMMENT 'วันที่',
  `empw_code` int(11) NOT NULL COMMENT 'รหัสรายการ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_log_time`
--

INSERT INTO `employee_log_time` (`empw_id`, `empw_empid`, `empw_name`, `empw_time_in`, `empw_time_out`, `empw_sum_hr`, `empw_ot`, `empw_date`, `empw_code`) VALUES
(1, 1334, 'กรกมล', '08:00:00', '19:00:00', '11:00:00', '02:30:00', '2019-05-26', 1),
(2, 1326, 'กรกมล', '09:00:00', '20:00:00', '11:00:00', '03:30:00', '2019-05-26', 1),
(3, 1326, 'กรกมล', '07:30:00', '19:00:00', '11:30:00', '02:30:00', '2019-05-27', 2),
(4, 4579, 'กรกมล', '07:00:00', '17:00:00', '10:00:00', '00:30:00', '2019-05-27', 1),
(9, 1300, 'Jiramate Phuaphan', '08:00:00', '20:00:00', '12:00:00', '03:00:00', '2019-11-26', 23);

-- --------------------------------------------------------

--
-- Table structure for table `employee_salary`
--

CREATE TABLE `employee_salary` (
  `empsa_id` int(11) NOT NULL,
  `empsa_empid` int(11) NOT NULL COMMENT 'รหัสพนักงาน',
  `empsa_salary` float NOT NULL COMMENT 'เงินเดือน',
  `empsa_bonus` float NOT NULL COMMENT 'โบนัส'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_salary`
--

INSERT INTO `employee_salary` (`empsa_id`, `empsa_empid`, `empsa_salary`, `empsa_bonus`) VALUES
(1, 1287, 21000, 42000),
(2, 1300, 18000, 18000),
(3, 1318, 20000, 20000),
(4, 1326, 25000, 50000),
(5, 1334, 23000, 23000),
(6, 1350, 18000, 18000),
(7, 1368, 19000, 38000),
(8, 1384, 18000, 36000),
(9, 1392, 18900, 18900),
(10, 1407, 15000, 30000),
(11, 1415, 16000, 16000),
(12, 1431, 19000, 19000),
(13, 1538, 19000, 19000),
(14, 1546, 18000, 18000),
(15, 1554, 17000, 34000),
(16, 1863, 19000, 38000),
(17, 1910, 20000, 40000),
(18, 1936, 19000, 38000),
(19, 2259, 22000, 22000),
(20, 2267, 18000, 18000),
(21, 2283, 16000, 32000),
(22, 2314, 16000, 32000),
(23, 2330, 18000, 18000),
(24, 2356, 23000, 23000),
(25, 2429, 16000, 16000),
(26, 2649, 17000, 17000),
(27, 3239, 18000, 36000),
(28, 3263, 20000, 20000),
(29, 3271, 20000, 40000),
(30, 3297, 18000, 18000),
(31, 4561, 20000, 20000),
(32, 4562, 16000, 16000),
(33, 4563, 18000, 36000),
(34, 4564, 16000, 32000),
(35, 4565, 16000, 32000),
(36, 4566, 17000, 17000),
(37, 4567, 17000, 17000),
(38, 4568, 17000, 17000),
(39, 4569, 17000, 17000),
(40, 4570, 17000, 17000),
(41, 4571, 17000, 34000),
(42, 4572, 19000, 19000),
(43, 4573, 12000, 24000),
(44, 4574, 12000, 24000),
(45, 4575, 12000, 24000),
(46, 4576, 12000, 24000),
(47, 4577, 12000, 24000),
(48, 4578, 12000, 12000),
(49, 4579, 12000, 12000),
(50, 4580, 12000, 12000);

-- --------------------------------------------------------

--
-- Table structure for table `employee_take_leave`
--

CREATE TABLE `employee_take_leave` (
  `emptl_id` int(11) NOT NULL,
  `emptl_empid` int(11) NOT NULL COMMENT 'รหัสพนักงาน',
  `emptl_fname` varchar(255) NOT NULL COMMENT 'ชื่อ',
  `emptl_lname` varchar(255) NOT NULL COMMENT 'สกุล',
  `emptl_type` varchar(255) NOT NULL COMMENT 'ประเภทการลา',
  `emptl_day` int(11) NOT NULL COMMENT 'จำนวนวันที่ลา'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_take_leave`
--

INSERT INTO `employee_take_leave` (`emptl_id`, `emptl_empid`, `emptl_fname`, `emptl_lname`, `emptl_type`, `emptl_day`) VALUES
(1, 1287, 'น.ส.ชุติกาน์', 'จรกา', 'ลาป่วย', 4),
(2, 1300, 'นายเดชาธร', 'นารถสูง', 'ลากิจ', 5),
(3, 1318, 'นายธราธร', 'ทองหอม', 'ลากิจ', 8),
(4, 1326, 'นายธราธร', 'ทองโคตร', 'ลาป่วย', 4),
(5, 1334, 'นายธีรพัฒน์', 'ผ่องแผ้ว', 'ลากิจ', 5),
(6, 1350, 'น.ส.นุสราทิพทย์', 'มีกุศล', 'ลาพักร้อน', 5),
(7, 1368, 'น.ส.เบญจวรรณ', 'ทับดู่', 'ลาพักร้อน', 3),
(8, 1384, 'น.ส.พรรณธิดา', 'สมภพ', 'ลากิจ', 2),
(9, 1392, 'น.ส.พรรณาราย', 'ดีจันทร์', 'ลากิจ', 5),
(10, 1407, 'น.ส.พัชริญา', 'พัฒนโพธิ์', 'ลาป่วย', 4),
(11, 1415, 'น.ส.พิชญ์สินี', 'คันทะจันทร์', 'ลาพักร้อน', 8),
(12, 1431, 'นายมนฤทธิ์', 'เดชประเสริฐ', 'ลาป่วย', 6),
(13, 1538, 'น.ส.เสาวนิตย์', 'พึ่งสว่าง', 'ลาป่วย', 7),
(14, 1546, 'น.ส.อาริยา', 'ก้อนแพง', 'ลาป่วย', 5),
(15, 1554, 'น.ส.อิศราภรณ์', 'จารุกมูล', 'ลาพักร้อน', 2),
(16, 1863, 'น.ส.พิพรรชน์', 'มิตรชื่น', 'ลาป่วย', 3),
(17, 1910, 'น.ส.สรัลชนา', 'เจริญจิตต์', 'ลาพักร้อน', 3),
(18, 1936, 'น.ส.สิดาพร', 'เครือวรรณ', 'ลาป่วย', 4),
(19, 2259, 'น.ส.กนกวรรณ', 'ป้องปาน', 'ลาป่วย', 5),
(20, 2267, 'น.ส.กรกมล', 'ตรงมหาวิเศษ', 'ลาพักร้อน', 6),
(21, 2283, 'น.ส.ชินานาฎ', '', 'ลาป่วย', 3),
(22, 2314, 'น.ส.ปิยภรณ์', 'นำเนตร์', 'ลาป่วย', 2),
(23, 2330, 'น.ส.วิภาวี', 'ยิ่งกำแหง', 'ลาป่วย', 7),
(24, 2356, 'น.ส.สโรชา', 'สีทะเล', 'ลาพักร้อน', 8),
(25, 2429, 'น.ส.วิลาวรรณ', 'คงแก้ว', 'ลากิจ', 5),
(26, 2649, 'น.ส.ชุติมา', 'อวนศรี', 'ลาป่วย', 3),
(27, 3239, 'นายกิติพงษ์', 'แสงห้วยไผ่', 'ลาป่วย', 5),
(28, 3263, 'น.ส.เรณู', 'ไทยวังชัย', 'ลาป่วย', 4),
(29, 3271, 'น.ส.สุจิตรา', 'ประเสริฐศิลป์', 'ลาป่วย', 6),
(30, 3297, 'น.ส.อมิตา', 'เรืองชิต', 'ลาป่วย', 4),
(31, 4561, 'น.ส. นิศากร', 'ทองบรรจบ', 'ลาป่วย', 5),
(32, 4562, 'นายสุชาติ ', 'คงหนู', 'ลากิจ', 4),
(33, 4563, 'นายสุรัตน์', 'รามแป้น', 'ลาป่วย', 3),
(34, 4564, 'นายสุนทร', 'พูลแก้ว', 'ลาป่วย', 2),
(35, 4565, 'นายสกูล', 'แก้วพิจิตร', 'ลาพักร้อน', 8),
(36, 4566, 'น.ส.รัตติยา', 'นาควิทูร', 'ลาพักร้อน', 7),
(37, 4567, 'น.ส.ยุวดี', 'พลายด้วง', 'ลาพักร้อน', 5),
(38, 4568, 'นางกิตติมา', 'ราเหม', 'ลาป่วย', 7),
(39, 4569, 'นายทศพล', 'มิ่งแก้ว', 'ลาป่วย', 6),
(40, 4570, 'นายธีรวัต', 'หนูรักษ์', 'ลากิจ', 2),
(41, 4571, 'นายกมล', 'บัวอิน', 'ลาป่วย', 5),
(42, 4572, 'นายประเสริฐ', 'คงประมูล', 'ลาป่วย', 2),
(43, 4573, 'นายอาคม', 'กาเลี่ยง ', 'ลาป่วย', 4),
(44, 4574, 'นายยุรนันท์', 'ทองจินดา', 'ลาป่วย', 3),
(45, 4575, 'นางธิราวัล', 'ทองแก้ว ', 'ลาป่วย', 2),
(46, 4576, 'น.ส.โสภานน', 'ทองสิพพัญญู', 'ลาป่วย', 4),
(47, 4577, 'นายเจษฎา', 'ทิมลาย', 'ลากิจ', 6),
(48, 4578, 'นายแดง', 'อนุพันธ์', 'ลาพักร้อน', 7),
(49, 4579, 'นายดิเรก', 'อนุเปโถ ', 'ลากิจ', 8),
(50, 4580, 'นายสนิท', 'หนูแก้ว', 'ลาป่วย', 5),
(51, 4580, 'นายสนิท', 'หนูแก้ว', 'ลาป่วย', 5);

-- --------------------------------------------------------

--
-- Table structure for table `employee_wage`
--

CREATE TABLE `employee_wage` (
  `empt_id` int(11) NOT NULL,
  `empl_empid` int(11) NOT NULL COMMENT 'รหัสพนักงาน',
  `empt_no` int(11) NOT NULL COMMENT 'สลิปเลขที่',
  `empt_name` varchar(255) NOT NULL COMMENT 'ชื่อผู้กรอก',
  `empt_hr` time NOT NULL COMMENT 'ชม.ทำงาน',
  `empt_wage` float NOT NULL COMMENT 'ค่าจ้าง',
  `empt_date` date NOT NULL DEFAULT current_timestamp() COMMENT 'วันที่'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_wage`
--

INSERT INTO `employee_wage` (`empt_id`, `empl_empid`, `empt_no`, `empt_name`, `empt_hr`, `empt_wage`, `empt_date`) VALUES
(1, 1326, 1, 'กรกมล', '11:00:00', 550, '2019-05-26'),
(4, 1334, 1, 'กรกมล', '11:00:00', 600, '2019-05-26'),
(6, 1326, 2, 'กรกมล', '11:30:00', 550, '2019-05-27'),
(8, 4579, 1, 'กิติพงษ์', '10:00:00', 550, '2019-05-27'),
(10, 1300, 23, 'Jiramate Phuaphan', '15:00:00', 750, '2019-11-26');

-- --------------------------------------------------------

--
-- Table structure for table `employee_work day`
--

CREATE TABLE `employee_work day` (
  `empwd_id` int(11) NOT NULL,
  `empwd_empid` int(11) NOT NULL COMMENT 'รหัสพนังงาน',
  `empwd_date` date NOT NULL COMMENT 'วันที่เข้าทำงาน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_work day`
--

INSERT INTO `employee_work day` (`empwd_id`, `empwd_empid`, `empwd_date`) VALUES
(1, 1287, '2552-01-01'),
(65, 1300, '2552-01-01'),
(66, 1318, '2552-01-01'),
(67, 1326, '2552-01-01'),
(68, 1334, '2552-01-01'),
(69, 1350, '2552-01-01'),
(70, 1368, '2552-01-01'),
(71, 1384, '2552-01-01'),
(72, 1392, '2552-01-01'),
(73, 1407, '2552-01-01'),
(74, 1415, '2552-01-01'),
(75, 1431, '2552-01-01'),
(76, 1538, '2552-01-01'),
(77, 1546, '2553-01-01'),
(78, 1554, '2553-01-02'),
(79, 1863, '2553-01-03'),
(80, 1910, '2553-01-04'),
(81, 1936, '2553-01-05'),
(82, 2259, '2553-01-06'),
(83, 2267, '2553-01-07'),
(84, 2283, '2553-01-08'),
(85, 2314, '2553-01-09'),
(86, 2330, '2553-01-10'),
(87, 2356, '2554-01-01'),
(88, 2429, '2554-01-02'),
(89, 2649, '2554-01-03'),
(90, 3239, '2554-01-04'),
(91, 3263, '2554-01-05'),
(92, 3271, '2554-01-06'),
(93, 3297, '2554-01-07'),
(94, 4561, '2554-01-08'),
(95, 4562, '2554-01-09'),
(96, 4563, '2554-01-10'),
(97, 4564, '2554-01-11'),
(98, 4565, '2554-01-12'),
(99, 4566, '2554-01-13'),
(100, 4567, '2554-01-14'),
(101, 4568, '2555-01-01'),
(102, 4569, '2555-01-02'),
(103, 4570, '2555-01-03'),
(104, 4571, '2555-01-04'),
(105, 4572, '2555-01-05'),
(106, 4573, '2555-01-06'),
(107, 4574, '2555-01-07'),
(108, 4575, '2555-01-08'),
(109, 4576, '2555-01-09'),
(110, 4577, '2555-01-10'),
(111, 4578, '2555-01-11'),
(112, 4579, '2555-01-12'),
(113, 4580, '2555-01-13');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`emp_id`);

--
-- Indexes for table `employee_department`
--
ALTER TABLE `employee_department`
  ADD PRIMARY KEY (`empdp_id`);

--
-- Indexes for table `employee_log_time`
--
ALTER TABLE `employee_log_time`
  ADD PRIMARY KEY (`empw_id`);

--
-- Indexes for table `employee_salary`
--
ALTER TABLE `employee_salary`
  ADD PRIMARY KEY (`empsa_id`);

--
-- Indexes for table `employee_take_leave`
--
ALTER TABLE `employee_take_leave`
  ADD PRIMARY KEY (`emptl_id`);

--
-- Indexes for table `employee_wage`
--
ALTER TABLE `employee_wage`
  ADD PRIMARY KEY (`empt_id`);

--
-- Indexes for table `employee_work day`
--
ALTER TABLE `employee_work day`
  ADD PRIMARY KEY (`empwd_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `employee`
--
ALTER TABLE `employee`
  MODIFY `emp_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;

--
-- AUTO_INCREMENT for table `employee_department`
--
ALTER TABLE `employee_department`
  MODIFY `empdp_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4634;

--
-- AUTO_INCREMENT for table `employee_log_time`
--
ALTER TABLE `employee_log_time`
  MODIFY `empw_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `employee_salary`
--
ALTER TABLE `employee_salary`
  MODIFY `empsa_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT for table `employee_take_leave`
--
ALTER TABLE `employee_take_leave`
  MODIFY `emptl_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `employee_wage`
--
ALTER TABLE `employee_wage`
  MODIFY `empt_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `employee_work day`
--
ALTER TABLE `employee_work day`
  MODIFY `empwd_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=114;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
